cmsis-svd/cmsis-svd/data/Atmel/ATSAM3U4E.xml
        <register>
          <name>CTRLB2</name>
          <description>DMAC Channel Control B Register (ch_num = 2)</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SRC_DSCR</name>
              <description>Source Address Descriptor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FETCH_FROM_MEM</name>
                  <description>Source address is updated when the descriptor is fetched from the memory.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FETCH_DISABLE</name>
                  <description>Buffer Descriptor Fetch operation is disabled for the source.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DST_DSCR</name>
              <description>Destination Address Descriptor</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FETCH_FROM_MEM</name>
                  <description>Destination address is updated when the descriptor is fetched from the memory.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FETCH_DISABLE</name>
                  <description>Buffer Descriptor Fetch operation is disabled for the destination.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC</name>
              <description>Flow Control</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MEM2MEM_DMA_FC</name>
                  <description>Memory-to-Memory Transfer DMAC is flow controller</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEM2PER_DMA_FC</name>
                  <description>Memory-to-Peripheral Transfer DMAC is flow controller</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER2MEM_DMA_FC</name>
                  <description>Peripheral-to-Memory Transfer DMAC is flow controller</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER2PER_DMA_FC</name>
                  <description>Peripheral-to-Peripheral Transfer DMAC is flow controller</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRC_INCR</name>
              <description>Incrementing, Decrementing or Fixed Address for the Source</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INCREMENTING</name>
                  <description>The source address is incremented</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECREMENTING</name>
                  <description>The source address is decremented</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXED</name>
                  <description>The source address remains unchanged</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DST_INCR</name>
              <description>Incrementing, Decrementing or Fixed Address for the Destination</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INCREMENTING</name>
                  <description>The destination address is incremented</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECREMENTING</name>
                  <description>The destination address is decremented</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXED</name>
                  <description>The destination address remains unchanged</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IEN</name>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG2</name>
          <description>DMAC Channel Configuration Register (ch_num = 2)</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01000000</resetValue>
          <fields>
            <field>
              <name>SRC_PER</name>
              <description>Source with Peripheral identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DST_PER</name>
              <description>Destination with Peripheral identifier</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRC_H2SEL</name>
              <description>Software or Hardware Selection for the Source</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SW</name>
                  <description>Software handshaking interface is used to trigger a transfer request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW</name>
                  <description>Hardware handshaking interface is used to trigger a transfer request.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DST_H2SEL</name>
              <description>Software or Hardware Selection for the Destination</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SW</name>
                  <description>Software handshaking interface is used to trigger a transfer request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW</name>
                  <description>Hardware handshaking interface is used to trigger a transfer request.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOD</name>
              <description>Stop On Done</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>STOP ON DONE disabled, the descriptor fetch operation ignores DONE Field of CTRLA register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>STOP ON DONE activated, the DMAC module is automatically disabled if DONE FIELD is set to 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_IF</name>
              <description>Interface Lock</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Interface Lock capability is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Interface Lock capability is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_B</name>
              <description>Bus Lock</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>AHB Bus Locking capability is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_IF_L</name>
              <description>Master Interface Arbiter Lock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHUNK</name>
                  <description>The Master Interface Arbiter is locked by the channel x for a chunk transfer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFFER</name>
                  <description>The Master Interface Arbiter is locked by the channel x for a buffer transfer.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB_PROT</name>
              <description>AHB Protection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOCFG</name>
              <description>FIFO Configuration</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALAP_CFG</name>
                  <description>The largest defined length AHB burst is performed on the destination AHB interface.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALF_CFG</name>
                  <description>When half FIFO size is available/filled, a source/destination request is serviced.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASAP_CFG</name>
                  <description>When there is enough space/data available to perform a single AHB access, then the request is serviced.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SADDR3</name>
          <description>DMAC Channel Source Address Register (ch_num = 3)</description>
          <addressOffset>0x000000B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SADDR</name>
              <description>Channel x Source Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DADDR3</name>
          <description>DMAC Channel Destination Address Register (ch_num = 3)</description>
          <addressOffset>0x000000B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DADDR</name>
              <description>Channel x Destination Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSCR3</name>
          <description>DMAC Channel Descriptor Address Register (ch_num = 3)</description>
          <addressOffset>0x000000BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DSCR</name>
              <description>Buffer Transfer Descriptor Address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLA3</name>
          <description>DMAC Channel Control A Register (ch_num = 3)</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BTSIZE</name>
              <description>Buffer Transfer Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCSIZE</name>
              <description>Source Chunk Transfer Size.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHK_1</name>
                  <description>1 data transferred</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_4</name>
                  <description>4 data transferred</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_8</name>
                  <description>8 data transferred</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_16</name>
                  <description>16 data transferred</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_32</name>
                  <description>32 data transferred</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_64</name>
                  <description>64 data transferred</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_128</name>
                  <description>128 data transferred</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_256</name>
                  <description>256 data transferred</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCSIZE</name>
              <description>Destination Chunk Transfer Size</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHK_1</name>
                  <description>1 data transferred</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_4</name>
                  <description>4 data transferred</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_8</name>
                  <description>8 data transferred</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_16</name>
                  <description>16 data transferred</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_32</name>
                  <description>32 data transferred</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_64</name>
                  <description>64 data transferred</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_128</name>
                  <description>128 data transferred</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_256</name>
                  <description>256 data transferred</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRC_WIDTH</name>
              <description>Transfer Width for the Source</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYTE</name>
                  <description>the transfer size is set to 8-bit width</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALF_WORD</name>
                  <description>the transfer size is set to 16-bit width</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD</name>
                  <description>the transfer size is set to 32-bit width</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DST_WIDTH</name>
              <description>Transfer Width for the Destination</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYTE</name>
                  <description>the transfer size is set to 8-bit width</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALF_WORD</name>
                  <description>the transfer size is set to 16-bit width</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD</name>
                  <description>the transfer size is set to 32-bit width</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DONE</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
